In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

### Connect to local database

In [2]:
engine = create_engine("mysql://root@localhost/wine_db")

### Check for tables

In [3]:
engine.table_names()

['Sun_Data', 'Wine_Data']

### Read in cleaned wine csv

In [4]:
csv_file = "../Raw_Data/wine_data_cleaned.csv"
wine_data_cleaned_df = pd.read_csv(csv_file)
wine_data_cleaned_df.head()

,State,Varietal,Wine,Points,Price
0,California,Abouriou,Cerridwen 2012 Moonlight Sonata Abouriou (Russ...,85,75.0
1,California,Aglianico,Giornata 2012 French Camp Vineyard Aglianico (...,92,30.0
2,California,Aglianico,Giornata 2014 Luna Matta Vineyard Aglianico (P...,92,45.0
3,California,Aglianico,Rosa d'Oro 2012 Aglianico (Clear Lake),92,28.0
4,California,Aglianico,Monte Volpe 2012 Aglianico (Mendocino),92,28.0

### Use pandas to load csv converted DataFrame into database - Wine

In [5]:
wine_data_cleaned_df.to_sql(name='Wine_Data', con=engine, if_exists='append', index=False)

### Confirm data has been added - Wine

In [6]:
pd.read_sql_query('select * from Wine_Data', con=engine).head()

,id,state,varietal,wine,points,price
0,1,California,Abouriou,Cerridwen 2012 Moonlight Sonata Abouriou (Russ...,85,75.0
1,2,California,Aglianico,Giornata 2012 French Camp Vineyard Aglianico (...,92,30.0
2,3,California,Aglianico,Giornata 2014 Luna Matta Vineyard Aglianico (P...,92,45.0
3,4,California,Aglianico,Rosa d'Oro 2012 Aglianico (Clear Lake),92,28.0
4,5,California,Aglianico,Monte Volpe 2012 Aglianico (Mendocino),92,28.0

### Read in sun data csv

In [6]:
csv_file = "../Raw_Data/state_sun.csv"
state_sun_df = pd.read_csv(csv_file)
state_sun_df.head()

        state  percentage_sunshine  total_sunshine_hours
0     Alabama                   58                  2641
1      Alaska                   41                  2061
2     Arizona                   85                  3806
3    Arkansas                   61                  2771
4  California                   68                  3055

### Use pandas to load csv converted DataFrame into database - Sun

In [7]:
state_sun_df.to_sql(name='Sun_Data', con=engine, if_exists='append', index=False)

### Confirm data has been added - Sun

In [8]:
pd.read_sql_query('select * from Sun_Data', con=engine).head()

   id       state  percentage_sunshine  total_sunshine_hours
0   1     Alabama                   58                  2641
1   2      Alaska                   41                  2061
2   3     Arizona                   85                  3806
3   4    Arkansas                   61                  2771
4   5  California                   68                  3055